Dlubal.DynamPro.DLCDampingParams
DLC - damping settings

Dlubal.DynamPro.DLCDampingParams.DampingType
Type of damping to be used

Dlubal.DynamPro.DLCDampingParams.Alpha
Rayleigh damping - alpha[rad/s]

Dlubal.DynamPro.DLCDampingParams.Beta
Rayleigh damping - beta[s/rad]

Dlubal.DynamPro.DLCDampingParams.D
Lehr's damping - D[-]

Dlubal.DynamPro.DLCDampingParams.LehrDampingTable
Lehr's damping by table - used only when DampingType = LehrDampingForEachMode